{
  "architectures": ["HELMForMaskedLM"],
  "model_type": "helm",

  "hidden_size": 1280,
  "sqrt_hidden_size": 36,
  "max_position_embeddings": 4096,
  "initializer_range": 0.028,
  "num_hidden_layers": 16,
  "num_attention_heads": 20,
  "rope_theta": 160000,

  "intermediate_size": 3456,
  "norm_eps": 1e-12,
  "hidden_act": "swiglu",
  "swiglu_s_init": 1.0,

  "tokenizer_path": "answerdotai/ModernBERT-base",
  "vocab_size": 50368,
  "bos_token_id": 50281,
  "eos_token_id": 50282,
  "pad_token_id": 50283,
  "mask_token_id": 50284,
  "unk_token_id": 50285,
  "mlm_probability": 0.3,
  "mlm_use_span_masking": true,
  "mlm_span_length": 3,

  "num_router_latents": 4,
  "max_active_heads": 6,
  "num_permanent_heads": 2,
  "selection_threshold": 0.5,
  "router_init_scale": 10.0,
  "jitter_noise": 0.01,
  "sparsity_lambda": 0.01,
  "router_aux_loss_coeff": 0.02,
  "router_grad_clip": 0.05,
  "sparsity_warm_up_steps": 2000,
  "use_sigmoid_scaling": false,

  "ngpt_sqk_init_value": 1.0,  
  "ngpt_sqk_init_scale": 0.028,
  "ngpt_alpha_value_attn": 0.05,
  "ngpt_alpha_scale_attn": 0.028,
  "ngpt_alpha_value_mlp": 0.05,
  "ngpt_alpha_scale_mlp": 0.028,
  "ngpt_suv_value": 1.0,
  "ngpt_suv_scale": 1.0,
  "ngpt_sz_init_value":  1.0,
  "ngpt_sz_init_scale": 0.028,


  "bias": false
}